# Delphine de Sanglier

In [2]:
# 8.1 EDA Demonstration
import pandas as pd
%matplotlib inline

In [3]:
# We will store the orders table csv data in a variable
df = pd.read_csv('orders.csv')

In [4]:
# Use the head method to investigate the first row of data
df.head()

,order_id,order_date,ship_date,ship_mode,customer_id,product_id,sales,quantity,discount,profit,postal_code,region_id
0,AE-2016-1308551,2016-09-28,2016-10-02,Second Class,PO-8865,OFF-FEL-10001405,82.67,2,0.3,0.3,NaN,9954.0
1,AE-2016-1522857,2016-09-04,2016-09-09,Standard Class,PO-8865,TEC-EPS-10004171,78.41,6,0.5,0.5,NaN,4792.0
2,AE-2016-184765,2016-10-03,2016-10-07,Second Class,PO-8865,OFF-FEL-10001405,82.67,2,0.3,0.3,NaN,19848.0
3,AE-2016-1878215,2016-09-15,2016-09-17,Standard Class,PO-8865,TEC-EPS-10004171,78.41,6,0.5,0.5,NaN,1410.0
4,AE-2016-218276,2016-10-09,2016-10-12,Standard Class,PO-8865,TEC-EPS-10004171,78.41,6,0.5,0.5,NaN,1826.0

In [6]:
# Use the .info method to view the column names and data types
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999991 entries, 0 to 999990
Data columns (total 12 columns):
order_id       999991 non-null object
order_date     999991 non-null object
ship_date      999991 non-null object
ship_mode      999991 non-null object
customer_id    999991 non-null object
product_id     999991 non-null object
sales          999991 non-null float64
quantity       999991 non-null int64
discount       999991 non-null float64
profit         999991 non-null float64
postal_code    192888 non-null float64
region_id      999795 non-null float64
dtypes: float64(5), int64(1), object(6)
memory usage: 91.6+ MB

In [8]:
# Use the shape attribute to determine the amount of rows and columns total
df.shape

(999991, 12)

In [13]:
# Use the .columns property to list out the column names
# Use the .index.name property to identify the index
print(df.columns)
print(df.index)

Index(['order_id', 'order_date', 'ship_date', 'ship_mode', 'customer_id',
       'product_id', 'sales', 'quantity', 'discount', 'profit', 'postal_code',
       'region_id'],
      dtype='object')
RangeIndex(start=0, stop=999991, step=1)

In [25]:
# Provide a dictionary to the rename method to rename any columns
# The inplace flag determines whether to modify the original dataframe
new_column_names={'quantity' : 'quantity_unit',
                   'sales' : 'sales_AUD'}

df.rename(columns=new_column_names, inplace=True)
df.head()

,order_id,order_date,ship_date,ship_mode,customer_id,product_id,sales_AUD,quantity_unit,discount,profit,postal_code,region_id
0,AE-2016-1308551,2016-09-28,2016-10-02,Second Class,PO-8865,OFF-FEL-10001405,82.67,2,0.3,0.3,NaN,9954.0
1,AE-2016-1522857,2016-09-04,2016-09-09,Standard Class,PO-8865,TEC-EPS-10004171,78.41,6,0.5,0.5,NaN,4792.0
2,AE-2016-184765,2016-10-03,2016-10-07,Second Class,PO-8865,OFF-FEL-10001405,82.67,2,0.3,0.3,NaN,19848.0
3,AE-2016-1878215,2016-09-15,2016-09-17,Standard Class,PO-8865,TEC-EPS-10004171,78.41,6,0.5,0.5,NaN,1410.0
4,AE-2016-218276,2016-10-09,2016-10-12,Standard Class,PO-8865,TEC-EPS-10004171,78.41,6,0.5,0.5,NaN,1826.0

In [26]:
# Explore columns with column attributes and methods
df.describe()

,sales_AUD,quantity_unit,discount,profit,postal_code,region_id
count,999991.000000,999991.000000,999991.000000,999991.000000,192888.000000,999795.000000
mean,245.885888,3.477444,0.247224,1.658624,55348.941095,6370.559013
std,481.540695,2.285502,0.137232,39.977661,32145.458536,10456.510728
min,0.440000,1.000000,0.000000,-6599.980000,1040.000000,38.000000
25%,30.680000,2.000000,0.130000,0.100000,23320.000000,2125.000000
50%,84.780000,3.000000,0.250000,0.200000,57103.000000,3688.000000
75%,250.740000,5.000000,0.350000,0.290000,90049.000000,5636.000000
max,22638.480000,14.000000,0.670000,8399.980000,99301.000000,98923.000000

In [29]:
df['quantity_unit'].value_counts()

2     248673
3     185703
1     176693
4     124039
5      96385
6      57881
7      46525
8      27941
9      19070
10      5353
14      3685
12      3408
11      3103
13      1532
Name: quantity_unit, dtype: int64

In [34]:
df['ship_mode'].unique()

array(['Second Class', 'Standard Class', 'Same Day', 'First Class'], dtype=object)

In [16]:
# 8.2 Exploring a new dataset
# Import the products.csv dataset and explore the following questions:
df2 = pd.read_csv('products.csv')
df2.head()

,product_id,category,sub_category,product_name,product_cost_to_consumer
0,FUR-ADV-10000002,Furniture,Furnishings,"Advantus Photo Frame, Duo Pack",53.04
1,FUR-ADV-10000108,Furniture,Furnishings,"Advantus Clock, Erganomic",50.01
2,FUR-ADV-10000183,Furniture,Furnishings,"Advantus Photo Frame, Black",15.89
3,FUR-ADV-10000188,Furniture,Furnishings,"Advantus Stacking Tray, Erganomic",24.99
4,FUR-ADV-10000190,Furniture,Furnishings,"Advantus Frame, Duo Pack",111.18

In [19]:
# A. What are the columns and index: do they suggest any relationship to other tables?
print(df2.columns)
print(df2.index)

## The product_id column are the same

Index(['product_id', 'category', 'sub_category', 'product_name',
       'product_cost_to_consumer'],
      dtype='object')
RangeIndex(start=0, stop=10292, step=1)

In [18]:
# B. How many rows of data are there?
len(df2)

10292

In [35]:
# C. What are the types of each column?
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10292 entries, 0 to 10291
Data columns (total 5 columns):
product_id                  10292 non-null object
category                    10292 non-null object
sub_category                10292 non-null object
product_name                10292 non-null object
product_cost_to_consumer    10292 non-null float64
dtypes: float64(1), object(4)
memory usage: 402.1+ KB

In [ ]:
# 8.3 Boolean Filtering
# Let's return to the orders dataset for the rest of the challenges
# Use boolean filtering and DataFrame/DataSeries methods to solve the following challanges:

In [42]:
df.columns

Index(['order_id', 'order_date', 'ship_date', 'ship_mode', 'customer_id',
       'product_id', 'sales_AUD', 'quantity_unit', 'discount', 'profit',
       'postal_code', 'region_id'],
      dtype='object')

In [43]:
# A. What is the mean profit of orders where the ship_mode is "Second Class"
df[df['ship_mode'] == 'Second Class']['profit'].mean()

1.0517047992868271

In [59]:
# B. Which product is the most commonly ordered on 2017-06-08 
df[df['order_date'] == '2017-06-08']['product_id'].mode()

0    OFF-ST-10001963
dtype: object

In [ ]:
# 8.4 Sorting and Filtering

In [164]:
# A. What are the three most profitable orders purchased by customer PO-8865?

# Create a subset dataframe # len = 218
PO_8865_orders = df[df['customer_id'] == 'PO-8865']


#Sort profit values from highest to lowest
PO_8865_orders = PO_8865_orders.sort_values(by='profit', ascending=False)
PO_8865_orders = PO_8865_orders.reset_index(drop=True)

# # print the 3 most profitable orders
PO_8865_orders[0:3]

,order_id,order_date,ship_date,ship_mode,customer_id,product_id,sales_AUD,quantity_unit,discount,profit,postal_code,region_id
0,AG-2017-2220,2017-12-26,2017-12-30,Standard Class,PO-8865,TEC-HEW-10002304,1908.72,6,0.2,190.80,NaN,12699.0
1,CA-2017-2910,2017-06-04,2017-06-08,Standard Class,PO-8865,OFF-BIN-10004729,198.00,4,0.1,65.28,NaN,2570.0
2,AG-2019-6470,2019-01-13,2019-01-15,First Class,PO-8865,TEC-SHA-10004874,293.85,1,0.2,61.68,NaN,45585.0

## Bonus Exploration!

Looking at PO_8865_orders.head(5) I realised that there are a few orders with the same order_id, with different product_id, quantities and profit. 

Could it be that we are missing out on a bigger order with a larger profit, just because it contains lots of rows of small profit products, that added together would, in the end, be part of a bigger order?

Let's find out!

In [144]:
# 1. check if there are multiple rows containing the same order number for that customer

df.head(2)

# sort the dataframe by ID. If there are orders that are equivalent, we will be able to check one row vs the next one
PO_8865_orders = PO_8865_orders.sort_values(by='order_id')
# We will count the rows that are the same
count=0

#iterate through the dataframe and count the duplicates
for i in range(0,len(PO_8865_orders)-1): # -1 since we check against the next row
    if PO_8865_orders['order_id'][i] == PO_8865_orders['order_id'][i+1]:
        count+=1

print(f"There are {count} duplicated or more orders for customer PO-8865")

There are 6 duplicated or more orders for customer PO-8865

In [165]:
# That is a few orders! Let's group them to be sure we are not missing out

# First, create a sub dataframe with just the order_id and profit, we don't need the rest 
# (This is more if an excuse, truth is it is mainly because I'm having issues using the groupby function for non-numeric values..)
PO_8865 = PO_8865_orders[['order_id', 'profit']]
PO_8865 = PO_8865.groupby(by='order_id').sum() # will sum the profit column

# sort by ascending value and print
PO_8865 = PO_8865.sort_values(by='profit', ascending=False)
PO_8865[0:3]

              profit
order_id
AG-2017-2220  191.25
AG-2019-6470  122.28
CA-2017-2910   66.69

## Conclusion

Although the first 3 largest orders are the same, the order has changed, as well as the total profit.

In [166]:
# B. What are the five orders of product_id TEC-HEW-10002304 with the highest quantity?
product_orders = df[df['product_id'] == 'TEC-HEW-10002304']
product_orders.sort_values(by='quantity_unit', ascending=False)
product_orders['order_id'][0:5]

581    AG-2017-1949725
608       AG-2017-2220
719     AG-2017-331077
734    AG-2017-3462496
743    AG-2017-3616897
Name: order_id, dtype: object

## Recap

We covered a lot of ground! It's ok if this takes a while to gel.

```python

# basic DataFrame operations
df.head()
df.tail()
df.shape
df.columns
df.index

# selecting columns
df.column_name
df['column_name']

# renaming columns
df.rename({'old_name':'new_name'}, inplace=True)
df.columns = ['new_column_a', 'new_column_b']

# notable columns operations
df.describe() # five number summary
df['col1'].nunique() # number of unique values
df['col1'].value_counts() # number of occurrences of each value in column

# filtering
df[ df['col1'] < 50 ] # filter column to be less than 50
df[ (df['col1'] == value1) & (df['col2'] > value2) ] # filter column where col1 is equal to value1 AND col2 is greater to value 2

# sorting
df.sort_values(by='column_name', ascending = False) # sort biggest to smallest

```


It's common to refer back to your own code *all the time.* Don't hesistate to reference this guide! üêº